// .h файл з усими потрібними бібліотекам, оголошеними дефайнами,
// оголошеннями масивів та прототипами функції вводу, виводу і меню

#pragma once     // щоб файл запустився лише 1 раз
#include <stdio.h>
#include <time.h>   // підключення потрібних бібліотек для вводу/виводу,
#include <windows.h> //  виміру часу та інших

#define pmax 700 // кількість перерізів масиву
#define nmax 700      // розмірність матриці порядку nmax
#define kmax 120000 // розміри вектору
extern int mas[pmax][nmax][nmax]; // оголошуємо глобальний масив максимального розміру

extern int vect[kmax]; // оголошуємо глобальний вектор

void vuvid(int const p, int const n);        // прототип процедури виводу масиву розміром p*n*n

void zap(int const p,int const n,int const mod ); // прототип процедури заповнення масиву заданого розміру
                                                 // за потрібною ознакою, що задається параметром mod

void menu();  //прототип процедури меню

