// файл меню з діалоговим інтерфейсом вибору методів сортування
#include "Header.h"
#include "Time.h"
#include "Sort_head.h"

void menu()
{
    int p,n;    //розмір масиву який вводе користувач
                //p - кількість перерізів
                //n  - кількість стовпців і рядків
    int var;
    printf("Чи хотіли б ви побачити як сортуються масиви?\n1 - Так\n2 - Ні\n3 - Виміри часу для вектору\nВвод : ");
    scanf("%d",&var);
    switch(var){
    case 1:{
        printf("Введіть кількість перерізів масиву(бажано <=3)\n");
        scanf("%d",&p);
        n = 5;  // сортування відубватиметься для p перерізів розміром n*n
                                        //показове сортування алг №1
        printf("Початковий масив:\n");
        zap(p,n,2);  // заповнення масиву
        vuvid(p,n);  // виведення невідсортованого масиву
        printf("Сортування алгоритмом №1 (Пряма вставка 1)\n");
        sort_1(p,n); // сортування масиву
        vuvid(p,n);  // вивід відсортованого масиву
                                        //показове сортування алг №2
        printf("Початковий масив:\n");
        zap(p,n,2);
        vuvid(p,n);
        printf("Сортування алгоритмом №2 (Прямий вибір 7)\n");
        sort_2(p,n);
        vuvid(p,n);

                                          //показове сортування алг №3
        printf("Початковий масив:\n");
        zap(p,n,2);
        vuvid(p,n);
        printf("Сортування алгоритмом №3 (Прямий обмін 4 - Шейкерне сортування)\n");
        sort_3(p,n);
        vuvid(p,n);
                                          //показове сортування алг №4
        printf("Початковий масив:\n");
        zap(p,n,2);
        vuvid(p,n);
        printf("Сортування алгоритмом №4 (Швидке сортування)\n");
        sort_4(0,n-1,p,n);
        vuvid(p,n);
    }
        break;
    case 2:{
        printf("\nЗапустити програму в пакетному режимі(відразу всі варіанти сортування)?\n1 - Так\n2 - Ні\nВвод : ");
        scanf("%d",&var);
        switch(var){
        case 1:{
        // побудова таблиці для всіх варіантів сортування
    printf("Введіть розміри масиву p і n <=700\n");
    scanf("%d %d",&p,&n);
    printf("---------------------------------------------------------------------------------");
    printf("\n\t\t\t | Впорядкований |  Випадковий  | Обернено впорядкований |\n");
    printf("---------------------------------------------------------------------------------");
    printf("\nСорт №1 (Пряма вставка 1)| %7.lf\t |%8.lf\t|%12.lf\t\t |\n",(double)time_sort_1(p,n,1),(double)time_sort_1(p,n,2),(double)time_sort_1(p,n,3));
    printf("---------------------------------------------------------------------------------");
    printf("\nСорт №2 (Прямий вибір 7) | %7.lf\t |%8.lf\t|%12.lf\t\t |\n",(double)time_sort_2(p,n,1),(double)time_sort_2(p,n,2),(double)time_sort_2(p,n,3));
    printf("---------------------------------------------------------------------------------");
    printf("\nСорт №3 (Шейкерне)       | %7.lf\t |%8.lf\t|%12.lf\t\t |\n",(double)time_sort_3(p,n,1),(double)time_sort_3(p,n,2),(double)time_sort_3(p,n,3));
    printf("---------------------------------------------------------------------------------");
    printf("\nСорт №4 (Швидке сорт)    | %7.lf\t |%8.lf\t|%12.lf\t\t |\n",(double)time_sort_4(p,n,1),(double)time_sort_4(p,n,2),(double)time_sort_4(p,n,3));
    printf("---------------------------------------------------------------------------------");
            break;
        }
        case 2:{
            int mod, v; // для вибору заповнення масиву та методу сортування
            printf("Виберіть який масив сортувати:\n1 - Впорядкований\n2 - Випадковий\n3 - Обернено впорядкований\nВвод : ");
            scanf("%d",&mod);
            printf("Виберіть метод сортування:\n1 - Пряма вставка №1\n2 - Прямий вибір №7\n3 - Шейкерне сортування\n4 - Швидке сортування\n5 - на початок\nВвод : ");
            scanf("%d",&v);
            switch(v){
            case 1:{
                printf("Введіть розміри масиву p і n <=700\n");
                scanf("%d %d",&p,&n);
                printf("Час сортування : %.lf",(double)time_sort_1(p,n,mod));
                break;
            }
            case 2:{
                printf("Введіть розміри масиву p і n <=700\n");
                scanf("%d %d",&p,&n);
                printf("Час сортування : %.lf",(double)time_sort_2(p,n,mod));
                break;
            }
            case 3:{
                printf("Введіть розміри масиву p і n <=700\n");
                scanf("%d %d",&p,&n);
                printf("Час сортування : %.lf",(double)time_sort_3(p,n,mod));
                break;
            }
            case 4:{
                printf("Введіть розміри масиву p і n <=700\n");
                scanf("%d %d",&p,&n);
                printf("Час сортування : %.lf",(double)time_sort_4(p,n,mod));
                break;
            }
            case 5:{
                menu();
                break;
            }
            default:
                break;
            }
            break;
        default:
            break;
        }
        }
        break;
    default:
        break;
    }
    case 3:
        printf("\nЧас сортування вектору розміром %d елементів:\n",kmax);
        printf("---------------------------------------------------------------------------------");
        printf("\n\t\t\t | Впорядкований |  Випадковий  | Обернено впорядкований |\n");
        printf("---------------------------------------------------------------------------------");
        printf("\nСорт №1 (Пряма вставка 1)| %7.lf\t |%8.lf\t|%12.lf\t\t |\n",(double)sort_vect(1,1),(double)sort_vect(2,1),(double)sort_vect(3,1));
        printf("---------------------------------------------------------------------------------");
        printf("\nСорт №2 (Прямий вибір 7) | %7.lf\t |%8.lf\t|%12.lf\t\t |\n",(double)sort_vect(1,2),(double)sort_vect(2,2),(double)sort_vect(3,2));
        printf("---------------------------------------------------------------------------------");
        printf("\nСорт №3 (Шейкерне)       | %7.lf\t |%8.lf\t|%12.lf\t\t |\n",(double)sort_vect(1,3),(double)sort_vect(2,3),(double)sort_vect(3,3));
        printf("---------------------------------------------------------------------------------");
        printf("\nСорт №4 (Швидке сорт)    | %7.lf\t |%8.lf\t|%12.lf\t\t |\n",(double)qsort_vect(1),(double)qsort_vect(2),(double)qsort_vect(3));
        printf("---------------------------------------------------------------------------------");
        break;
    }
    printf("\nПродовжити роботу програми?\n1 - Так\n2 - Ні\nВвод: ");
    scanf("%d",&var);
    if(var==1)
        menu();
}
